In [60]:
import pandas as pd 

data = {
    'Name': ['Amy White', 'Jack Steward', 'Richard Laudardale', 'Sara Johnson'],
    'Age': [50, 53, 35, 43],
    'Working Experiance (Yrs)': [5, 4, 3, 2]
}

df = pd.DataFrame(data)
print(df)

                 Name  Age  Working Experiance (Yrs)
0           Amy White   50                         5
1        Jack Steward   53                         4
2  Richard Laudardale   35                         3
3        Sara Johnson   43                         2

In [61]:
address = ['Sofia', 'York', 'Berlin', 'Amsterdam']
df['Address'] = address

display(df)

                 Name  Age  Working Experiance (Yrs)    Address
0           Amy White   50                         5      Sofia
1        Jack Steward   53                         4       York
2  Richard Laudardale   35                         3     Berlin
3        Sara Johnson   43                         2  Amsterdam

In [62]:
#Calculate the average age

df['Age'].mean()

np.float64(45.25)

In [63]:
#average working experience

df['Working Experiance (Yrs)'].mean()

np.float64(3.5)

In [64]:
import numpy as np

df['Seniority'] = np.where(df['Age'] >= 50, 'Senior', 'Junior')
display(df)

                 Name  Age  Working Experiance (Yrs)    Address Seniority
0           Amy White   50                         5      Sofia    Senior
1        Jack Steward   53                         4       York    Senior
2  Richard Laudardale   35                         3     Berlin    Junior
3        Sara Johnson   43                         2  Amsterdam    Junior

In [65]:
df.sort_values(by='Working Experiance (Yrs)', ascending=False)

                 Name  Age  Working Experiance (Yrs)    Address Seniority
0           Amy White   50                         5      Sofia    Senior
1        Jack Steward   53                         4       York    Senior
2  Richard Laudardale   35                         3     Berlin    Junior
3        Sara Johnson   43                         2  Amsterdam    Junior

In [72]:
df.where(df['Working Experiance (Yrs)'] > 3)

           Name   Age  Working Experiance (Yrs) Address Seniority
0     Amy White  50.0                       5.0   Sofia    Senior
1  Jack Steward  53.0                       4.0    York    Senior
2           NaN   NaN                       NaN     NaN       NaN
3           NaN   NaN                       NaN     NaN       NaN

In [75]:

 df.loc[df['Age'].idxmin()]

Name                        Richard Laudardale
Age                                         35
Working Experiance (Yrs)                     3
Address                                 Berlin
Seniority                               Junior
Name: 2, dtype: object

In [77]:
df.loc[df['Name'] == 'Sara Johnson', 'Address'] = 'Rotterdam'

display(df)

                 Name  Age  Working Experiance (Yrs)    Address Seniority
0           Amy White   50                         5      Sofia    Senior
1        Jack Steward   53                         4       York    Senior
2  Richard Laudardale   35                         3     Berlin    Junior
3        Sara Johnson   43                         2  Rotterdam    Junior